<help page="B&uuml;ros (Desks)">

<p>Die B&uuml;rostruktur erlaubt es Ihnen und anderen Bricolage Anwendern, Assets gemeinsam zu nutzen und auszutauschen.</p>

<p>Nachdem Sie ein neues Gut erstellen und speichern, residiert es standardm&auml;&szlig;ig in Ihrem Arbeitsbereich. Sie k&ouml;nnen es dann in ein B&uuml;ro einchecken, um es anderen Personen in Ihrer Gemeinschaft zur Verf&uuml;gung zu stellen. Wenn ein Anwender von einem B&uuml;ro das Gut editiert und es freigibt, wird er oder sie es zum n&auml;chsten B&uuml;ro transferieren; dieser Prozess wird sich wiederholen, bis das Gut zur Ver&ouml;ffentlichung bereit ist.</p>

<p>Ein B&uuml;ro &auml;hnelt stark einem Arbeitsbereich in Aussehen und Verwendung -- es ist ledoglich eine Version zum Gemeingebrauch. Wenn ein photographisches Mediengut z.B. im &quot;Kunstb&uuml;ro&quot; residiert, kann jeder Anwender, der Zugang zum &quot;Kunstb&uuml;ro&quot; besitzt, auf das Photo zugreifen, wenn auch nur gleichzeitig jeweils eine Person es editieren kann.</p>

<h3>G&uuml;tereigenschaften (in B&uuml;ros)</h3>

<p><dl>
<dt>Titel</dt>
<dd>Klicken Sie um das Gut in einem anderen Fenster als Vorschau darzustellen (au&szlig;er Vorlagen).</dd>

<dt>Kategorie</dt>
<dd>Wo in einer Site das Gut ver&ouml;ffentlicht wird.</dd>

<dt>Titelblattdatum</dt>
<dd>Das Datum, das mit dem Gut angezeigt wird. Dies ist nicht zwingenderweise das Ver&ouml;ffentlichungsdatum, aber es wird Lesern als das Ver&ouml;ffentlichungsdatum erscheinen.</dd>

<dt>Priorit&auml;t</dt>
<dd>Teilt Anwendern mit, welche Dringlichkeit das Gut besitzt.</dd>

<dt>Auschecken</dt>
<dd>Bringt das Gut in Ihren Arbeitsbereich, wo Sie es editieren k&ouml;nnen. Wenn ein Gut ausgecheckt wird, wird es nach wie vor im zuletzt abgelegten B&uuml;ro aufgef&uuml;hrt und kann dort angesehen werden, aber es kann nicht an einen anderen Anwender ausgecheckt werden, bis es nicht wieder in das B&uuml;ro eingecheckt wurde. Wenn das Gut an einen anderen Anweder ausgecheckt wurde, steht hier der Name des Anwenders, der das Gut ausgecheckt hat, statt dieses Links.</dd>

<dt>Einchecken</dt>
<dd>Wenn Sie diese Option sehen bedeutet es, da&szlig; Sie das Gut von diesem B&uuml;ro in Ihren Arbeitsbereich ausgecheckt haben. Um andere Anwender das Gut editieren zu lassen m&uuml;ssen Sie auf diesen Link klicken, um das Gut in das B&uuml;ro zur&uuml;ck einzuchecken.</dd>

<dt>Verschieben</dt>
<dd>Dieses Auswahlmen&uuml; verschiebt das Gut zu einem anderen B&uuml;ro. W&auml;hlen Sie das gew&uuml;nschte B&uuml;ro, gehen Sie zum Ende der Seite und klicken Sie auf <i>G&uuml;ter verschieben.</i> Sie k&ouml;nnen gleichzeitig mehr als ein Gut verschieben. Dieses Auswahlmen&uuml; steht nicht zur Verf&uuml;gung, wenn das Gut an einen anderen Anwender ausgecheckt wurde.</dd>

<dt>Notizen</dt>
<dd>Zur Betrachtung der von Anwendern an das Gut hinzugef&uuml;gten Notizen.</dd>

<dt>Spur</dt>
<dd>Listet auf, an welche B&uuml;ros das Gut eingecheckt wurde.</dd>

<dt>Editieren</dt>
<dd>Diese Option erscheint nur, wenn das Gut an Ihren Arbeitsbereich ausgecheckt wurde.</dd>

<dt>Log</dt>
<dd>Zeigt die Aktionsgeschichte des Gutes an.</dd>

<dt>Ver&ouml;ffentlichen</dt>
<dd>Diese Checkbox ist nur in den B&uuml;ros vorhanden, die als Ver&ouml;ffentlichungsb&uuml;ros designiert wurden. Um ein Gut zu ver&ouml;ffentlichen, selektieren Sie diese Box und klicken Sie auf <i>Markierte Ver&ouml;ffentlichen</i> am Ende der Seite. Mehrere G&uuml;ter k&ouml;nnen gleichzeitig ver&ouml;ffentlicht werden.</dd>

<dt>Ausbringen</dt>
<dd>Diese Checkbox ist nur in den B&uuml;ros vorhanden, die in Vorlagen-Workflows als Ausbringungsb&uuml;ros designiert wurden. Um ein Gut auszubringen, selektieren Sie diese Box und klicken Sie auf <i>Markierte Ausbringen</i> am Ende der Seite. Mehrere Vorlagen k&ouml;nnen gleichzeitig ausgebracht werden.
</dl></p>

</help>
