<help page="Vorlagenprofildaten">

<h3>1) Information</h4>

<p><dl>
<dt>Spur</dt>
<dd>Listet auf, an welche B&uuml;ros die Vorlage eingecheckt wurde (keine, wenn es sich um eine neue Vorlage handelt).</dd>

<dt>Notizen</dt>
<dd>Klicken Sie auf dieses Icon um redaktionelle Notizen an die Vorlage anzuf&uuml;gen. Diese Notizen sind f&uuml;r andere Anwender sichtbar, werden jedoch nicht mit ver&ouml;ffentlicht. Wenn das Icon aussieht, als w&auml;re es beschriftet, sind bereits Notizen mit dieser Vorlage verkn&uuml;pft.</dd>

<dt>G&uuml;terart</dt>
<dd>Die Art der Vorlage, wie sie auf der Seite 'Neue Vorlage erstellen' gew&auml;hlt wurde. Wenn sie mit keinem bestehenden Element assoziiert ist, wird die Art der Vorlage &quot;Generisch&quot; sein.</dd>

<dt>Name der Vorlage</dt>
<dd>Der Titel der Vorlage. Diese ist gleich der G&uuml;terart wenn die Vorlage auf einem existierenden Element basiert.</dd>

<dt>Ausgabekanal</dt>
<dd>Das Ziel f&uuml;r die Vorlage, wenn es einmal ausgebracht ist.</dd>

<dt>Kategorie</dt>
<dd>Wo in Ihrer Site die Vorlage ausgebracht wird.</dd>

<dt>URI</dt>
<dd>Die Adresse der Vorlage auf dem Server.</dd>

<dt>Priorit&auml;t</dt>
<dd>Teilt Anwendern mit, wie wichtig diese Vorlage ist. Dieses Feld ist zwingend vorgeschrieben.</dd>

<dt>Beschreibung</dt>
<dd>Eine kurze Beschreibung der Vorlage.</dd>

<dt>Verfallsdatum</dt>
<dd>Datum und Uhrzeit zu der Sie w&uuml;nschen, da&szlig; die Vorlage entfernt wird (verf&auml;llt).</dd>
</dl></p>

<h3>2) Vorlagencode</h3>

<p><dl>
<dt>Element</dt>
<dd>Das Element auf dem die Vorlage basiert, falls zutreffend.</dd>

<dt>Datenelemente</dt>
<dd>Elemente, die automatisch im Inhaltsabschnitt der Vorlage erscheinen. Die mit &quot;wiederholbar&quot; gekennzeichneten k&ouml;nnen mehrmals hinzugef&uuml;gt werden. Diejenigen, die mit &quot;vorgeschrieben&quot; gekennzeichnet sind m&uuml;ssen vom Benutzer ausgef&uuml;llt werden um die Vorlage abspecihern zu k&ouml;nnen.</dd>

<dt>Containerelemente</dt>
<dd>Elemente die der Vorlage hinzugef&uuml;gt werden k&ouml;nnen, sie erscheinen in einem Pulldown unter den Datenelementen. Die mit "wiederholbar" gekennzeichneten k&ouml;nnen mehrmals angef&uuml;gt werden.</dd>
</dl></p>

<p>Tragen Sie zus&auml;tzlichen Code f&uuml;r die Vorlage in das daf&uuml;r vorgesehene Feld ein. Klicken Sie auf <i>Speichern</i> wenn Sie fertig sind.</p>

</help>
