<help page="Mein Arbeitsbereich">

<p>Dies ist Ihre Heimatbasis. Hier speichern Sie alle G&uuml;ter die Sie erstellen, bevor Sie sie in ein B&uuml;ro einchecken. Sie k&ouml;nnen auch G&uuml;ter von B&uuml;ros auschecken um Sie in Ihrem Arbeitsbereich zu editieren.</p>

<p>Klicken Sie auf <i>Mein Arbeitsbereich</i> in der oberen linken Ecke um jederzeit zu diesem Bereich zur&uuml;ckzukehren.</p>

<h3>G&uuml;ter</h3>

<p>Sie k&ouml;nnen drei verschiedene Arten von G&uuml;tern in Ihrem Arbeitsbereich verwalten: Medien, Beitr&auml;ge und Vorlagen. Neu erstellte G&uuml;ter bleiben in Ihrem Arbeitsbereich bis Sie sie in ein anderes B&uuml;ro verschieben -- oder einchecken.</p>

<p>Durch einchecken eines Gutes in ein anderes B&uuml;ro erlauben Sie es anderen Anwendern, auf dieses Gut zuzugreifen. B&uuml;ros sind wie Stationen in einer Fertigungsstra&szlig;e - ein Gut mu&szlig; von jedem B&uuml;ro freigegeben werden bevor es an die Anwender versandt werden kann.</p>

<p>Nehmen wir zum Beispiel an, da&szlig; Sie einen neuen Artikel f&uuml;r Ihre Website erstellt haben. Sie checken es in das Redaktionsb&uuml;ro ein, wo ein Redakteur die Struktur und Korrektheit pr&uuml;ft. Der Redakteur checkt den Artikel in das Rechtsb&uuml;ro ein, wo ein Anwalt sicherstellt, da&szlig; der Artikel rechtlich unbedenklich ist. Danach geht es zur Revision, wo es auf Grammatik und Rechtschreibung gepr&uuml;ft wird. Letztendlich kommt es in das Ver&ouml;ffentlichungsb&uuml;ro, von wo aus es zur Website kopiert wird.</p>

<p>An jedem dieser Punkte wirde die Person, die das Gut editieren mu&szlig;, dieses auschecken oder in seinen Arbeitsbereich verschieben. Wenn ein Gut in einem B&uuml;ro an einen Anwender ausgecheckt wird, bleibt es in dem B&uuml;ro aufgef&uuml;hrt und kann von anderen Anwendern gelesen werden, aber nur derjenige der es ausgecheckt hat, kann es editieren.</p>

<h3>G&uuml;tereigenschaften (im Arbeitsbereich)</h3>

<p><dl>
<dt>Titel</dt>
<dd>Klicken Sie um das Gut in einem anderen Fenster als Vorschau zu betrachten (au&szlig;er Vorlagen). Ein wei&szlig;es &quot;P&quot; in einem roten Kreis am Ende des Titelfeldes zeigt an, da&szlig; das Gut ver&ouml;ffentlicht (bzw. ausgebracht bei Vorlagen) wurde.</dd>

<dt>Kategorie</dt>
<dd>Wo auf der Site das Gut ver&ouml;ffentlicht wird</dd>

<dt>Titelblattdatum</dt>
<dd>Das Datum, das mit dem Beitrag angezeigt wird. Dies ist nicht zwingenderweise das Ver&ouml;ffentlichungsdatum, aber es wird Lesern als das Ver&ouml;ffentlichungsdatum erscheinen.</dd>

<dt>Priorit&auml;t</dt>
<dd>Teilt Anwendern mit, wie dringlich das Gut ist.</dd>

<dt>Einchecken nach</dt>
<dd>W&auml;hlen Sie das gew&uuml;nschte B&uuml;ro aus der Liste, gehen Sie zum Ende der Seite und klicken Sie auf <i>G&uuml;ter einchecken</i>. Sie k&ouml;nnen mehrere G&uuml;ter gleichzeitig einchecken.</dd>

<dt>Notizen</dt>
<dd>Zum ansehen evtl. redaktioneller Notizen die an das Gut angeh&auml;ngt wurden.</dd>

<dt>Spur</dt>
<dd>Listet auf, an welche B&uuml;ros dder Beitrag eingecheckt wurde.</dd>

<dt>Editieren</dt>
<dd>Ver&auml;ndern Sie das Gut oder sein Profil.<BR>

<dt>Protokoll</dt>
<dd>Zeigt die Geschichte der Ereignisse dieses Gutes.</dd>

<dt>L&ouml;schen</dt>
<dd>Setzen Sie ein H&auml;kchen in die L&ouml;schen-Bos, gehen Sie zum Ende der Seite und klicken Sie auf 'Ausgew&auml;hlte L&ouml;schen'. Sie k&ouml;nnen mehrere G&uuml;ter auf einmal l&ouml;schen.</dd>
</dl></p>

</help>
