<help page="Zielprofil">

<p>Dieses Formular dient zum editieren oder zum erstellen von <dfn>Zielen</dfn>, und bietet Informationen dar&uuml;ber, wie das Ziel zum ver&ouml;ffentlichen von Inhalt verwendet werden kann.<p>

<p>Im ersten Schritt der Erstellung eines neuen Ziels sind nur die ersten zwei Teile des Formulars sichtbar. Wenn diese ausgef&uuml;llt sind, klicken Sie auf 
&#8216;Weiter&#8217; um zum Rest des Formulares zu gelangen. Das komplette Formular wird auch beim editieren eines existierenden Ziels angezeigt.</p>


<h3>Eigenschaften</h3>

<dl>
 <dt>Name</dt>
 <dd>Der Name des Ziels. Dieser mu&szlig; einzigartig sein, wird aber nur verwendet, um verschiedene Ziele besser unterscheiden zu k&ouml;nnen.</dd>

 <dt>Beschreibung</dt>
 <dd>Eine genauere Beschreibung des Zwecks des Zieles.</dd>

 <dt>Verschiebungsmethode</dt>
 <dd>Die Methode, die zum kopieren der Daten an das Ziel verwendet wird. Der tats&auml;chlich zur Verf&uuml;gung stehende Umfang an Optionen h&auml;ngt davon ab, wie Ihre Bricolage-Installation konfiguriert wurde, kann aber folgendes beinhalten:

  <dl>
   <dt>Dateisystem</dt>
   <dd>Eine einfache Kopie &uuml;ber das Dateisystem.</dd>

   <dt>FTP</dt>
   <dd>Upload auf einen Zielserver mittels FTP.</dd>

   <dt>SFTP</dt>
   <dd>Upload auf einen Ziel server mittels SFTP (secure FTP).</dd>

   <dt>WebDAV</dt>
   <dd>Upload auf einen Zielserver mittels HTTP mit WebDAV.</dd>
  </dl>
 </dd>

 <dt>Ressourcen kopieren</dt>
 <dd>Falls angew&auml;hlt, werden die zu verteilenden Ressourcen zun&auml;chst in ein tempor&auml;res Verzeichnis umkopiert, bevor &#8216;Aktionen&#8217; darauf angewandt werden.</dd>

 <dt>Ver&ouml;ffentlichung</dt>
 <dd>Falls angew&auml;hlt (was &uuml;blicherweise der Fall ist) wir dieses Ziel f&uuml;r die Ver&ouml;ffentlichung fertigen Outputs verwendet.</dd>

 <dt>Vorschau</dt>
 <dd>Falls angew&auml;hlt kann dieses Ziel zur Vorschau verwendet werden.</dd>
</dl>


<h3>Ausgabekan&auml;le</h3>

<p>In diesem Abschnitt werden die Ausgabekan&auml;le, die f&uuml; dieses Ziel verwendet werden, gesetzt.</p>


<h3>Aktionen</h3>

<p>Verwenden Sie diesen Teil des Formulars um <dfn>Aktionen</dfn>, welches die Arten von Bearbeitung sind, die auf den Output angewendet werden wenn es zu einem Ziel ver&ouml;ffentlicht wird, hinzuzuf&uuml;gen, editieren oder zu l&ouml;schen.</p>

<p>&Uuml;blicherweise gibt es nur eine Aktion vom Typ &#8216;Verschieben&#8217;, die die eigentliche Kopier- oder Upload-Operation durchf&uuml;hrt.</p>


<h3>Server</h3>

<p>Verwenden Sie diesen Teil des Formulars um <dfn>Server</dfn>, welche definieren wie Output bei Ver&ouml;ffentlichung an die Server geschickt wird, zu definieren. Wenn z.B. die FTP-Methode verwendet werden soll, mu&szlig; hier ein Benutzername und Pa&szlig;wort f&uuml;r den Server angegeben werden.</p>

</help>
