<help page="Elementprofil">

<p>
<dl>

<dt>Eigenschaften</dt>
<dd>Tragen Sie den Elementnamen, Schl&uuml;sselnamen und eine kurze Beschreibung ein. Der Schl&uuml;sselname sollte eine einzigartige Kennung bestehend aus einem einzelnen Wort sein. W&auml;hlen Sie den Brennertyp, den Ihre Vorlagen verwenden sollen. Beim hinzuf&uuml;gen eines neuen Elementes k&ouml;nnen Sie auch den Elementtypen w&auml;hlen.</dd>

<dt>Gruppenmitgliedschaften</dt>
<dd>Gruppen legen die Rechte fest, die die Benutzer beim lesen, editieren oder erstellen von Elementen dieses Typs haben werden. W&auml;hlen Sie eine Gruppe von der 'Verf&uuml;gbare Gruppen' Liste und klicken Sie auf 'Zur Liste hinzuf&uuml;gen' um es zu 'Aktuelle Gruppen' hinzuzuf&uuml;gen. Sie k&ouml;nnen eine Gruppe von 'Aktuelle Gruppen' entfernen, indem Sie die Gruppe selektieren und auf 'Aus Liste entfernen' klicken. Wenn Sie ein neues Element erstellen, klicken Sie auf 'Weiter' um fortzufahren. Sie werden dann zum vollst&auml;ndigen Elementprofil weitergeleitet.</dd>

<dt>Sites</dt>
<dd>Elemente ersten Ranges (Top-Level Elements, also Elemente vom Typ Beitrag und Medien) k&ouml;nnen von mehreren Sites gemeinsam verwendet werden. Dieser Abschnitt wird f&uuml;r Elemente, die nicht ersten Ranges sind, nicht angezeigt.
Der Abschnitt Sites erlaubt Ihnen, Sites zu Elementen hinzuzuf&uuml;gen oder von ihnen zu entfernen. Sie k&ouml;nnen auch den prim&auml;ren Ausgabekanal f&uuml;r jede Site w&auml;hlen.</dd>

<dt>Ausgabekan&auml;le</dt>
<dd>Elemente ersten Ranges werden mit einem oder mehreren Ausgabekan&auml;len assoziiert. Dieser Abschnit ist f&uuml;r Elemente niederen Ranges nicht vorhanden.
Ausgabekan&auml;le bestimmen wie Ihre Beitr&auml;ge formatiert und wohin Beitr&auml;ge und Medien verteilt werden. Sie haben unterschiedliche Vorlagen, so da&szlig; Sie die gleichen Elemente auf unterschiedliche Arten ver&ouml;ffentlichen k&ouml;nnen. Es mu&szlig; mindestens ein Ausgabekanal mit einem Element ersten Ranges assoziiert sein.</dd>

<dt>Vorhandene Subelemente</dt>
<dd>Elemente sind in Wirklichkeit Container f&uuml;r weitere Elemente und Datenfelder. Um einem Element Subelemente hinzuzuf&uuml;gen klicken Sie auf 'Subelemente hinzuf&uuml;gen' um die Seite 'Subelemente w&auml;hlen' darzustellen. Verwenden Sie die Suche wie gewohnt um alle oder eine Untermenge der verf&uuml;gbaren Subelemente anzuzeigen. Erwartungsgem&auml;&szlig; werden keine Elemente ersten Ranges in den auszuw&auml;hlenden Elementen erscheinen. Um Elemente hinzuzuf&uuml;gen, setzen Sie ein H&auml;kchen in die zugeh&ouml;rige 'Zum Element Hinzuf&uuml;gen'-Box und klicken Sie dann auf 'Elemente hinzuf&uuml;gen'; falls Sie sich doch dagenen entscheiden, Subelemente hinzuzunehmen, lassen Sie die Boxen leer und klicken Sie auf 'Elemente hinzuf&uuml;gen'. Dies bringt Sie zum Elementprofil zur&uuml;ck.</dd>

<dt>Anwendungsspezifische Felder</dt>
<dd>In Feldern werden Daten abgelegt. Zusammen mit den Subelementen definieren sie die Struktur eines Elements. Im Abschnitt Anwendungsspezifische Felder k&ouml;nnen Sie den vorgegebenen Wert f&uuml;r das Feld anpassen. Sie k&ouml;nnen die Reihenfolge der Felder &auml;ndern indem Sie die Nummer im Popup-Men&uuml; ausw&auml;hlen. Um das Feld zu editieren, klicken Sie auf den Link Editieren. Dies bringt Sie zum Feldprofil, wo Sie alle Feldeigenschaften bis auf den Schl&uuml;sselnamen und Type (textarea, checkbox, etc.) ver&auml;ndern k&ouml;nnen. Um abschlie&szlig;end ein Feld zu l&ouml;schen, setzen Sie die 'L&ouml;schen'-Checkbox und klicken Sie auf einen der 'Speichern'-Kn&ouml;pfe unten auf der Seite.</dd>

<dt>Neues Feld hinzuf&uuml;gen</dt>
<dd>Hier k&ouml;nnen Sie neue Felder zum Abschnitt Anwendugsspezifische Felder hinzuf&uuml;gen. W&auml;hlen Sie zun&auml;chst den Feldtyp aus der Gruppe von Checkboxen links. Durch etwas JavaScript-Magie &auml;ndert dies die verf&uuml;gbaren Attribute auf der rechten Seite je nachdem, welchen Feldtyp Sie w&auml;hlen. Die Attribute werden im Detail auf der <a href="field_type.html">Feldprofil Hilfeseite</a> beschrieben.</dd>

</dl>
</p>

<p>Wenn Sie fertig sind, klicken Sie auf <em>Speichern</em>, oder klicken Sie auf <em>Speichern und Bleiben</em> um Ihre &Auml;nderungen zu sichern aber das Element weiter zu bearbeiten. Ein Klick auf <em>Zur&uuml;ck</em> bringt Sie zur Elementverwaltung zur&uuml;ck ohne Ihre &Auml;nderungen zu sichern.</p>

</help>
