<help page="Elementtypprofil">

<p>
<dl>

<dt>Eigenschaften</dt> <dd>Tragen Sie den Elementtypnamen,
Schl&uuml;sselnamen und eine kurze Beschreibung ein. Der
Schl&uuml;sselname sollte eine einzigartige Kennung bestehend aus
einem einzelnen Wort sein. Tragen Sie den Elementtypnamen,
Schl&uuml;sselnamen und eine kurze Beschreibung ein. Der
Schl&uuml;sselname sollte eine einzigartige Kennung bestehend aus
einem einzelnen Wort sein. Wenn der Elementtyp eine Beitragsseite
repr&auml;sentiert oder eine Relation mit einem Beitrag (Story) oder einem
Media erlaubt, w&auml;hlen Sie die entsprechende Checkbox. Wenn der
Elementtyp ein Beitragstyp oder ein Medientyp ist und eine feste URI
haben soll (&uuml;blicherweise bedeutet das, dass nur die Kategorie-URI die
Dokument-URI bildet), w&auml;hlen Sie die Checkbox <q>Fixed</q>. Der
<q>Typ</q> bezeichnet den Typ des Elementtyps: <q>Beitrag</q> f&uuml;r
Beitragstypen, <q>Media</q> f&uuml;r Medientypen oder <q>Unterelement</q>
f&uuml;r Unterelemente. Mediatypen-Elemente k&ouml;nnen auﬂerdem einem der drei
Untertypen entsprechen: <q>Audio,</q> <q>Image,</q> <q>Video,</q> oder
<q>Andere Medien</q>.</dd>

<dt>Gruppenmitgliedschaften</dt>
<dd>Gruppen legen die Rechte fest, die die Benutzer beim Lesen, Editieren oder Erstellen von Elementtypen dieser Art haben werden. W&auml;hlen Sie eine Gruppe von der 'Verf&uuml;gbare Gruppen' Liste und klicken Sie auf 'Zur Liste hinzuf&uuml;gen' um es zu 'Aktuelle Gruppen' hinzuzuf&uuml;gen. Sie k&ouml;nnen eine Gruppe von 'Aktuelle Gruppen' entfernen, indem Sie die Gruppe selektieren und auf 'Aus Liste entfernen' klicken. Wenn Sie einen neuen Elementtyp erstellen, klicken Sie auf 'Weiter' um fortzufahren. Sie werden dann zum vollen Elementtypprofil weitergeleitet.</dd>

<dt>Sites</dt>
<dd>Elementtypen ersten Ranges (Beitrag und Medien) k&ouml;nnen von mehreren Sites gemeinsam verwendet werden. Dieser Abschnitt wird f&uuml;r Elemente, die nicht ersten Ranges sind, nicht angezeigt.
Der Abschnitt <q>Sites</q> erlaubt Ihnen, Sites zu Elementen hinzuzuf&uuml;gen oder von ihnen zu entfernen. Sie k&ouml;nnen auch den prim&auml;ren Ausgabekanal f&uuml;r jede Site w&auml;hlen.</dd>

<dt>Vorhandene Subelemente</dt>
<dd><p>Elemente sind in Wirklichkeit Container f&uuml;r weitere Elemente und Datenfelder. Um einem Element Subelemente hinzuzuf&uuml;gen klicken Sie auf 'Subelemente hinzuf&uuml;gen' um die Seite 'Subelemente w&auml;hlen' darzustellen. Verwenden Sie die Suche wie gewohnt um alle oder eine Untermenge der verf&uuml;gbaren Subelemente anzuzeigen. Erwartungsgem&auml;&szlig; werden keine Elemente ersten Ranges in den auszuw&auml;hlenden Elementen erscheinen. Um Elemente hinzuzuf&uuml;gen, setzen Sie ein H&auml;kchen in die zugeh&ouml;rige 'Zum Element Hinzuf&uuml;gen'-Box und klicken Sie dann auf 'Elemente hinzuf&uuml;gen'; falls Sie sich doch dagenen entscheiden, Subelemente hinzuzunehmen, lassen Sie die Boxen leer und klicken Sie auf 'Elemente hinzuf&uuml;gen'. Dies bringt Sie zum Elementprofil zur&uuml;ck.</p>
  <p>Wenn Sie im Elementtypprofil zur&uuml;ck sind, k&ouml;nnen Sie das
  Minimum und Maximum der Anzahl der Elemente eines jeden Typs
  spezifizieren, welches zum Element hinzugef&uuml;gt werden
  kann. Wird ein neues Element dieses Typs erzeugt, so wird daf&uuml;r
  die minimale Anzahl der Unterelemente automatisch erzeugt. Der
  Benutzer wird nie mehr als die maximale Anzahl der Elemente
  hinzuf&uuml;gen k&ouml;nnen. Falls das Feld <q>Min</q> leer ist oder
  <q>0</q> (default), dann gibt es keine Minimalanzahl. Gleiches gilt
  f&uuml;r das Feld <q>Max</q>: leer oder 0 bedeutet, es gibt keine
  Maximalanzahl von Unterelementen, die hinzugef&uuml;gt werden
  k&ouml;nnen.</p>
</dd>

<dt>Anwendungsspezifische Felder</dt>
<dd>In Feldern werden Daten abgelegt. Zusammen mit den Subelementtypen definieren sie die Struktur eines Elementtyps. Im Abschnitt Anwendungsspezifische Felder k&ouml;nnen Sie den vorgegebenen Wert f&uuml;r das Feld anpassen. Sie k&ouml;nnen die Reihenfolge der Felder &auml;ndern indem Sie die Nummer im Popup-Men&uuml; ausw&auml;hlen. Um das Feld zu editieren, klicken Sie auf den Link Editieren. Dies bringt Sie zum Feldprofil, wo Sie alle Feldeigenschaften bis auf den Schl&uuml;sselnamen und Type (textarea, checkbox, etc.) ver&auml;ndern k&ouml;nnen. Um abschlie&szlig;end ein Feld zu l&ouml;schen, setzen Sie die 'L&ouml;schen'-Checkbox und klicken Sie auf einen der 'Speichern'-Kn&ouml;pfe unten auf der Seite.</dd>

<dt>Neues Feld hinzuf&uuml;gen</dt>
<dd>Hier k&ouml;nnen Sie neue Felder zum Abschnitt Anwendugsspezifische Felder hinzuf&uuml;gen. W&auml;hlen Sie zun&auml;chst das Widget aus der Gruppe von Checkboxen links. Die f&uuml;r das Management dieses Widgets notwendigen Felder werden im Rest dieses Abschnittes angezeigt. Die Attribute werden im Detail auf der <a href="field_type.html">Feldprofil Hilfeseite</a> beschrieben.</dd>

</dl>
</p>

<p>Wenn Sie fertig sind, klicken Sie auf <em>Speichern</em>, oder klicken Sie auf <em>Speichern und Bleiben</em> um Ihre &Auml;nderungen zu sichern aber das Element weiter zu bearbeiten. Ein Klick auf <em>Zur&uuml;ck</em> bringt Sie zur Elementverwaltung zur&uuml;ck ohne Ihre &Auml;nderungen zu sichern.</p>

</help>
