<help page="Aktionen">

<h3>Neuer Beitrag</h3>

<p>Auf dieser Seite k&ouml;nnen Sie Beitr&auml;ge f&uuml;r Ihre Website erstellen. Es gibt vier Arten von Beitr&auml;gen, von denen jeder mehrere Variablen und optionale Elemente besitzt, die Sie dazu verwenden k&ouml;nnen um das Aussehen des Beitrages zu steuern.</p>

<p>Beitragsarten</p>

<p><dl>
<dt>Artikel</dt>
<dd>F&uuml;r normale Nachrichten und Sonderbeitr&auml;ge.</dd>

<dt>Kolumne</dt>
<dd>F&uuml;r redaktionelle Artikel, Analysen und Kolumnen.</dd>

<dt>Buchkritik</dt>
<dd>Enth&auml;lt ein Profilmuster um wichtige Informationen &uuml;ber das diskutierte Thema anzuzeigen.</dd>

<dt>Deckblatt</dt>
<dd>Anders als die restlichen Beitragsarten, bietet das Deckblatt mehr einen Abschnitt oder eine Homepage, die auf andere Seiten und Beitr&auml;ge verlinkt.</dd>
</dl></p>

<p>Beitrag erstellen</p>

  <ol>
  <li>Klicken Sie auf <i>Neuer Beitrag</i> im linken Rahmen
    und tragen Sie folgende Informationen ein:

  <dl>
  <dt>Title</dt>
  <dd>Die Kopfzeile bzw. der Titel des Beitrages.</dd> 

  <dt>Kurzname</dt>
  <dd>Ein einzelnes Wort als Name des unterstes Verzeichnis f&uuml;r den Beitrag.</dd>

  <dt>Beitragsart</dt>
  <dd>W&auml;hlen Sie die Art des Beitrages, den Sie erstellen m&ouml;chten.</dd>

  <dt>Quelle</dt>
  <dd>Derjenige, der den Inhalt des Beitrages zur Verf&uuml;gung gestellt hat.</dd>

  <dt>Prim&auml;re Kategorie</dt>
  <dd>Kategorie, mit der der Beitrag prim&auml;r verkn&uuml;pft ist. Weitere Kategorien k&ouml;nnen als sekund&auml;re Kategorien hinzugef&uuml;gt werden.</dd>

  <dt>Priorit&auml;t</dt>
  <dd>Zeigt die Dringlichkeit des Beitrages an.</dd>

  <dt>Titelblattdatum</dt>
  <dd>Das Datum, das mit dem Beitrag angezeigt wird. Dies ist nicht zwingenderweise das Ver&ouml;ffentlichungsdatum, aber es wird Lesern als das Ver&ouml;ffentlichungsdatum erscheinen.</dd>
  
  </dl>
  </li>
  
  <li>Klicken Sie auf <i>Erstellen</i> um die bisherigen Informationen zu &uuml;bermitteln.
  </li>
    
    <li>Dies bringt Sie zur <i>Beitragsprofil</i>-Seite. Auf dieser Seite geben Sie Daten ein und f&uuml;gen Elemente hinzu um den Beitrag zu formen. Klicken Sie auf Speichern am unteren Ende der Seite um den Beitrag in Ihren Arbeitsbereich zu sichern.</li>
  </ol>
  
<p>Beitragsprofildaten</p>

<h3>1) Information</h3>

<dl>
<dt>Notizen</dt>
<dd>Klicken Sie auf dieses Icon um redaktionelle Notizen an den Beitrag anzuf&uuml;gen. Diese Notizen sind f&uuml;r andere Anwender sichtbar, werden jedoch nicht mit ver&ouml;ffentlicht.</dd>

<dt>Spur</dt>
<dd>Listet auf, an welche B&uuml;ros dder Beitrag eingecheckt wurde (keine, wenn es sich um einen neuen Beitrag handelt).</dd>

<dt>ID</dt>
<dd>Die Identifizierungsnummer des Beitragess, welche automatisch vergeben wird.</dd>

<dt>Beitragsart</dt>
<dd>Artikel, Kolumne, Buchkritik oder Deckblatt.</dd>

<dt>URI</dt>
<dd>Die Adresse des Beitrages auf Ihrem Server, inklusive der Kategorie und des Slugs (Kurznamen), den Sie auf der vorhergehenden Seite angeben haben. Ist der URI ein Link, k&ouml;nnen Sie draufklicken um eine Vorschau des Beitrages zu sehen. NB: die Vorschau wird leer erscheinen, wenn Sie noch keinen Text eingegeben haben.</dd>

<dt>Quelle</dt>
<dd>Derjenige, der den Beitragstext zur Verf&uuml;gung gestellt hat.</dd>

<dt>Priorit&auml;t</dt>
<dd>Zeigt Anwendern die Dringlichkeit dieses Mediums. Dieses Feld ist zwingend vorgeschrieben. Dieses Feld ist zwingend vorgeschrieben.</dd>

<dt>Titel</dt>
<dd>Die Titelzeile des Beitrages. Dieses Feld ist zwingend vorgeschrieben.</dd>

<dt>Beschreibung</dt>
<dd>Eine kurze Beschreibung des Beitrages.</dd>

<dt>Kurzname</dt>
<dd>Ein einzelnes Wort als Name des unterstes Verzeichnis f&uuml;r den Beitrag.</dd>

<dt>Titelblattdatum</dt>
<dd>Das Datum, das mit dem Beitrag angezeigt wird. Dies ist nicht zwingenderweise das Ver&ouml;ffentlichungsdatum, aber es wird Lesern als das Ver&ouml;ffentlichungsdatum erscheinen.</dd>

<dt>Verfallsdatum</dt>
<dd>Datum und Uhrzeit zu dem das Medium aus dem Verkehr gezogen wird.</dd>
</dl></p>

<h3>2) Inhalt</h3>

<p>Hier geben Sie dem Beitrag Form, indem Sie existierende Elemente editieren und neue hinzuf&uuml;gen. Jede Beitragsart hat eine bestimmte Sammlung an Elementen -- manche werden automatisch hinzugef&uuml;gt, andere sind optional.</p>

<p>NB: Anwender mit administrativem Zugang k&ouml;nnen die Elementsammlung f&uuml;r die Beitragsarten anpassen und neue Elemente generieren.</p>

<p>Klicken Sie auf 'Editieren' neben einem Element um zur Elementprofilseite zu gelangen. Dort k&ouml;nnen Sie text hinzuf&uuml;gen und Attribute w&auml;hlen. Um ein neues Element hinzuzuf&uuml;gen, w&auml;hlen Sie eines aus dem Auswahlmen&uuml; und klicken Sie auf 'Element hinzuf&uuml;gen'. Sie werden automatisch auf die Elementprofilseite des Elementes weitergeleitet.</p>

<p><dl>
<dt>Reihenfolge &Auml;ndern</dt>
<dd>Um die Reihenfolge der Elemente zu &auml;ndern, verwenden Sie die Pulldowns um die Positionsnummern zu &auml;ndern. Klicken Sie dann auf "Reihenfolge &auml;ndern".</dd>

<dt>L&ouml;schen</dt>
<dd>Um ein Element zu l&ouml;schen, setzen Sie ein H&auml;kchen in die Box neben dem Element und klicken Sie auf "L&ouml;schen". Sie k&ouml;nnen mehrere Elemente auf einmal l&ouml;schen.</dd>
</dl></p>

<h3>3) Kategorien</h3>

<p>Kategorien bestimmen, wo in der Site ein Beitrag ver&ouml;ffentlicht wird. Ein Objekt kann in einer oder in mehreren Kategorien liegen, aber nur eine wird als prim&auml;re Kategorie designiert. Bei Ihrem ersten Durchgang wird die einzige Kategorie des Beitrages die sein, die Sie auf der Seite 'Neuer Beitrag' w&auml;hlten. Um eine weitere Kategorie hinzuzuf&uuml;gen, w&auml;hlen Sie eine aus dem Pulldown und klicken Sie auf 'Kategorie hinzuf&uuml;gen'.</p>
 
<p><dl> 
   <dt>Prim&auml;re</dt>
   <dd>Um eine neue Kategorie als prim&auml;re zu setzen, klicken Sie auf den Kreis daneben und klicken Sie auf <i>Speichern</i> oder <i>Speichern und bleiben</i> am Ende der Seite.</dd>

  <dt>L&ouml;schen</dt>
  <dd>Um eine Kategorie zu l&ouml;schen, setzen Sie ein H&auml;kchen in die Box neben der Kategorie und klicken Sie dann auf "L&ouml;schen". Sie k&ouml;nnen mehrere Kategorien auf einmal l&ouml;schen.</dd>
</dl></p>

<h3>4) Verkn&uuml;pfungen</h3>

<p>In diesem Abschnitt stellen Sie Metainformationen (Informationen, die zum Beitrag geh&ouml;ren, aber nicht dargestellt werden) zur Verf&uuml;gung. Diese erlauben genauere Suchen und automatisierte Verkn&uuml;pfungen zwischen Beitr&auml;gen.</p>

<p><dl>
<dt>Stichworte</dt>
<dd>Tragen Sie hier zum Beitragsthema relevante W&ouml;rter oder Phrasen ein die behilflich sind, den Beitrag mit verwandten Beitr&auml;gen zu verkn&uuml;pfen oder den Beitrag &uuml;ber Archivsuchen zu finden. Klicken Sie auf <i>Editieren</i> um zur Stichworte Editieren Seite zu gelangen und tragen Sie dort Ihre Stichworte ein. Sie m&uuml;ssen nicht alle vier Felder ausf&uuml;llen, aber Sie k&ouml;nnen soviele zus&auml;tzliche Felder hinzuf&uuml;gen wie Sie ben&ouml;tigen, indem Sie auf <i>Weitere hinzuf&uuml;gen</i> klicken. Wenn Sie fertig sind, klicken Sie auf <i>Speichern</i>.</dd>

<dt>Mitarbeiter</dt>
<dd>Tragen Sie die Namen der Ersteller des Objekts ein, inklusive des Authors und evtl. Fotografen oder Zeichner deren Arbeiten enthalten sind. Klicken Sie auf <i>Editieren</i> um zur Mitarbeiter-Assoziationsseite zu gelangen. Suchen Sie unter Mitarbeiter ausw&auml;hlen den Namen der Person und klicken Sie auf <i>Verkn&uuml;pfen</i>. W&auml;hlen Sie auf der n&auml;chsten Seite seine Rolle und klicken Sie auf <i>Weiter</i>. Wenn Sie fertig sind, klicken Sie auf <i>Speichern</i>.</dd>
</dl></p>

<h3>Beitrag suchen</h3>

<p>Hier k&ouml;nnen Sie in allen B&uuml;ros nach existierenden Beitr&auml;gen suchen.</p>

<dl>
<dt>Einfache Suche</dt>
<dd>Die standardm&auml;&szlig;ige Suche ist sehr einfach: tragen Sie nur einen Titel, URL oder Stichwort ein und klicken Sie auf <i>Suchen</i>. F&umml;r eine vollst&auml;ndige Liste aller Beitr&auml;ge, lassen Sie das Feld leer und klicken Sie auf <i>Suchen</i>.</dd>

<dt>Erweiterte Suche</dt>
<dd>Hier k&ouml;nnen Sie spezifischere Angaben dar&uuml;ber machen, welche Beitr&auml;ge Sie suchen. F&uuml;llen Sie eines oder alle Felder aus und klicken Sie auf <i>Suchen</i>. Um Ihre Suche neu zu beginnen, klicken Sie auf <i>Felder l&ouml;schen</i>.</dd>

<dt>Gefundene Beitr&auml;ge</dt>
<dd>Klicken Sie neben dem gew&uuml;nschten Beitrag auf <i>Editieren</i> um zu seiner Beitragsprofileseite zu gelangen.</dd>

<dt>Neuen Beitrag erstellen</dt>
<dd>Wenn Sie das, was Sie suchen in den vorhandenen Beitr&auml;gen nicht finden, warum erstellen Sie nicht einen neuen? Dieser Link bringt Sie zur Seite 'Neuer Beitrag'.</dd>
</dl>

<h3>Aktive Beitr&auml;ge</h3>

<p>Zeigt eine Liste aller aktiven Beitr&auml;ge zusammen mit den wichtigsten Informationen dazu. Klicken Sie neben einem Beitrag auf <i>Editieren</i> um sein Beitragsprofil zu &auml;ndern.</p>

</help>