<help page="B&uuml;ros (Desks)">

<p>Die B&uuml;rostruktur erlaubt es Ihnen und anderen Bricolage Anwendern, Beitr&auml;ge gemeinsam zu nutzen und auszutauschen.</p>

<p>Nachdem Sie einen neuen Beitrag erstellen und speichern, residiert er standardm&aum l;&szlig;ig in Ihrem Arbeitsbereich. Sie k&ouml;nnen ihn dann in ein B&uuml;ro einchecken, um ihn anderen Personen in Ihrer Gemeinschaft zur Verf&uuml;gung zu stellen. Wenn ein Anwender von einem B&uuml;ro den Beitrag editiert und ihn freigibt, wird er oder sie ihn zum n&auml;chsten B&uuml;ro transferieren; dieser Prozess wird sich wiederholen, bis der Beitrag zur Ver&ouml;ffentlichung bereit ist.</p>

<p>Ein B&uuml;ro &auml;hnelt stark einem Arbeitsbereich in Aussehen und Verwendu
ng -- es ist lediglich eine Version zum Gemeingebrauch. Wenn ein photographische
s Mediengut z.B. im &quot;Kunstb&uuml;ro&quot; residiert, kann jeder Anwender, d
er Zugang zum &quot;Kunstb&uuml;ro&quot; besitzt, auf das Photo zugreifen, wenn 
auch nur gleichzeitig jeweils eine Person es editieren kann.</p>

<h3>Beitragseigenschaften (in B&uuml;ros)</h3>

<p><dl>
<dt>Titel</dt>
<dd>Klicken Sie um den Beitrag in einem anderen Fenster als Vorschau darzustellen.</dd>

<dt>Kategorie</dt>
<dd>Wo in einer Site der Beitrag ver&ouml;ffentlicht wird.</dd>

<dt>Titelblattdatum</dt>
<dd>Das Datum, das mit dem Beitrag angezeigt wird. Dies ist nicht zwingenderweise das Ver&ouml;ffentlichungsdatum, aber es wird Lesern als das Ver&ouml;ffentlichungsdatum erscheinen.</dd>

<dt>Priorit&auml;t</dt>
<dd>Teilt Anwendern mit, welche Dringlichkeit der Beitrag besitzt.</dd>

<dt>Auschecken</dt>
<dd>Bringt den Beitrag in Ihren Arbeitsbereich, wo Sie ihn editieren k&ouml;nnen. Wenn ein Beitrag ausgecheckt wird, wird er nach wie vor im zuletzt abgelegten B&uuml;ro aufgef&uuml;hrt und kann dort angesehen werden, aber er kann nicht an einen anderen Anwender ausgecheckt werden, bis er nicht wieder in das B&uuml;ro eingecheckt wurde. Wenn der Beitrag an einen anderen Anweder ausgecheckt wurde, steht hier der Name des Anwenders, der den Beitrag ausgecheckt hat, statt dieses Links.</dd>

<dt>Einchecken</dt>
<dd>Wenn Sie diese Option sehen bedeutet es, da&szlig; Sie den Beitrag von diesem B&uuml;ro in Ihren Arbeitsbereich ausgecheckt haben. Um andere Anwender den Beitrag editieren zu lassen m&uuml;ssen Sie auf diesen Link klicken, um den Beitrag in das B&uuml;ro zur&uuml;ck einzuchecken.</dd>

<dt>Verschieben</dt>
<dd>Dieses Auswahlmen&uuml; verschiebt den Beitrag zu einem anderen B&uuml;ro. W&auml;hlen Sie das gew&uuml;nschte B&uuml;ro, gehen Sie zum Ende der Seite und klicken Sie auf <i>Beitrag verschieben.</i> Sie k&ouml;nnen gleichzeitig mehrere Beitr&auml;ge verschieben. Dieses Auswahlmen&uuml; steht nicht zur Verf&uuml;gung, wenn der Beitrag an einen anderen Anwender ausgecheckt wurde.</dd>

<dt>Notizen</dt>
<dd>Zur Betrachtung der von Anwendern an den Beitrag hinzugef&uuml;gten Notizen.</dd
>

<dt>Spur</dt>
<dd>Listet auf, an welche B&uuml;ros der Beitrag eingecheckt wurde.</dd>

<dt>Editieren</dt>
<dd>Diese Option erscheint nur, wenn der Beitrag an Ihren Arbeitsbereich ausgecheckt
 wurde.</dd>

<dt>Log</dt>
<dd>Zeigt die Aktionsgeschichte des Beitrages an.</dd>

</help>


