<help page="Super Bulk Edit">

<p>Verwenden Sie das Super Bulk Edit Interface um all Felder und Subelemente eines Elementes gleichzeitig zu editieren. Felder und Subelemente werden durch ein Gleichheitszeichen (=) und den Schl&uuml;sselnamen des Feldes oder Subelementes abgegrenzt. Feldtags werden gefolgt von einer Leerzeile und dem Text des Feldes. Es wird angenommen, da&szlig; der Feldtext selbst keine Leerzeilen enth&auml;t. Subelementtags existieren allein auf einer Zeile, aber <em>ihre</em> Felder und Subelemente k&ouml;nnen nicht direkt editiert werden.</p>

<p>Zum Beispiel, um ein Element zu editieren, welches die Felder &quot;header&quot; und &quot;paragraph&quot; und das subelement &quot;inset&quot; enth&auml;lt, k&ouml;nnte die Super Bulk Edit syntax wie folgt aussehen:</p>

<pre><code>=header

Dies ist ein Header

=paragraph

Erster Absatz.

=paragraph

Zweiter Absatz.

=inset

=paragraph

Dritter Absatz.
</code></pre>

<p>Um den Inhalt eines Elementes umzuordnen, bewegen Sie einfach den Inhalt der Elemente und ihre entsprechenden Tags dorthin, wo Sie sie ben&ouml;tigen. Wenn Sie z.B. den Header im obigen Beispiel nach dem ersten Absatz plazieren m&ouml;chten, editieren Sie es einfach wie folgt:</p>

<pre><code>=paragraph

Erster Absatz.

=header

Dies ist ein Header

=paragraph

Zweiter Absatz.

=inset

=paragraph

Dritter Absatz.
</code></pre>

<p>Um Platz zu sparen und das editieren zu vereinfachen, k&ouml;nnen Sie ein &quot;Default Element&quot; w&auml;hlen, f&uuml;r das kein Tag n&ouml;tig ist. Wenn z.B. &quot;paragraph&quot; als Default Element gew&auml;hlt wurde, wird das obige Beispiel folgenderma&szlig;en aussehen:</p>

<pre><code>Erster Absatz.

=header

Dies ist ein Header

Zweiter Absatz.

=inset

Dritter Absatz.
</code></pre>

<p>Beachten Sie letztlich, da&szlig; leere Felder trotzdem eine Leerzeile enthalten m&uuml;ssen, welche das leere Feld anzeigt. Wenn z.B. das obige Beispielelement ein Feld &quot;link_text&quot; beinhaltet, welches kein Text enth&auml;lt, w&uuml;rde es wie folgt aussehen:</p>

<pre><code>Erster Absatz.

=header

Dies ist ein Header

=link_text



Zweiter Absatz.

=inset

Dritter Absatz.
</code></pre>

<p>Beachten Sie die zus&auml;tzlichen Leerzeilen nach dem <code>=link_text</code> Tag. Diese Syntax ist n&ouml;tig, damit Bricolage erkennt, da&szlig; das Feld existiert, aber keine Daten enth&auml;lt.</p>

</help>
